Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གཉིས་ཤེས་རབ་ཆེན་པོ་ཡབ། །ཤེས་རབ་མཆོག་མ་རྒྱལ་ཡུམ་ཤེས་རབ་བྱིན། །སྲས་ཡིན་ཤེས་རབ་བཟང་པོ་རིམ་གྲོ་པ། །
en: His family will be kṣatriya, And his light will extend twenty-two leagues. “Great Insight will be his father, and Supreme Insight will be this victor’s mother. Insight Gift will be his son and Excellent Insight his attendant.

source: ཤེས་རབ་ཆེན་པོ་བློ་གྲོས་ཅན་ཡིན་ཏེ། །
en: Great Insight will be the one of intelligence

source: འཇིགས་པ་མེད་པའི་ཤེས་རབ་རྫུ་འཕྲུལ་ཅན། །
en: And Fearless Insight the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །རྒྱལ་བའི་རྒྱལ་པོ་ཡི་ནི་ཚོགས་མཆོག་རྣམས། །བྱེ་བ་ཕྲག་ནི་ཁྲི་ཕྲག་བཅུ་བཅུ་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering one trillion Members of the supreme community of this king of victors.

source: བདུད་དང་ཉོན་མོངས་ཐམས་ཅད་འཇོམས་མཛད་པའི། །དམ་ཆོས་ལོ་གྲངས་བརྒྱད་ཁྲིའི་བར་དུ་གནས། །
en: “And the sacred Dharma of this defeater of all māras and defilements Will remain for eighty thousand years.

source: དེ་བཞིན་གཤེགས་པ་འཇམ་པའི་དབྱངས་སྐྱེ་བའི། །ཡུལ་ནི་ཡིད་དུ་འོང་བའི་དབྱངས་ཞེས་བྱ། །
en: “The thus-gone one Mañjughoṣa Will be born in a place called Delightful Melody.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བདུན་སྟོང་ཡབ་ནི་ཡིད་འཐད་ཡིན། །དབྱངས་མཆོག་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend seven thousand leagues. “Reasoning Mind will be his father, and Supreme Melody will be this victor’s mother.

source: སྲས་པོ་དབྱངས་སྲེད་དགའ་བོ་རིམ་གྲོ་པ། །
en: Melody Lover will be his son and Joyous his attendant.

source: དུལ་བར་གནས་པའི་དབྱངས་ནི་མཁས་པ་སྟེ། །
en: Melody of Abiding by the Training will be the scholar

source: འདུས་པ་ལན་གྲངས་བཅུ་སྟེ་ཀུན་ལ་ཡང་། །ཕ་རོལ་ཕྱིན་ལ་ཤིན་ཏུ་ངེས་ཐོབ་པ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གསུམ་གསུམ་ཡོད། །
en: “There will be ten consecutive congregations, Each of them gathering two hundred thirty million Who have attained certainty regarding the perfections.

source: འཇིག་རྟེན་མཁྱེན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་སྟོང་གི་བར་དུ་གནས་པར་འགྱུར། །
en: “And the sacred Dharma of this knower of the world Will remain for one thousand years.

source: འཇིག་རྟེན་མཁྱེན་པ་མྱ་ངན་འདས་པ་ཡི། །སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་བརྒྱད་པ་གཅིག །
en: Upon attaining nirvāṇa the relics of this knower of the world Will reside in a stūpa measuring eight leagues.

source: དེ་བཞིན་གཤེགས་པ་ཆགས་པ་མེད་མཛད་ཀྱི། །སྐྱེ་བའི་ཡུལ་ནི་བསོད་ནམས་བསགས་ཞེས་བྱ། །
en: “The thus-gone Asaṅgakośa Will be born in a place called Accumulation of Merit.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བདུན་ཅུ་ཡབ་ནི་ཆགས་མེད་ཡིན། །ལྷ་བདག་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend seventy leagues. “Detached will be his father, and Divine Being will be this victor’s mother.

source: སྲས་པོ་བདེན་སྦྱིན་ལྷ་ཆེན་རིམ་གྲོ་པ། །
en: Truth Gift will be his son and Great Divinity his attendant.

source: མཛོད་ཆེན་འཆང་བ་བློ་གྲོས་ཅན་ཡིན་ཏེ། །
en: Great Treasury Holder will be the one of intelligence

source: རྣམ་པར་ངེས་པའི་ལྷ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And God of Certainty the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་ཀུན་ལ་ཡང་། །དངོས་པོར་འཛིན་དང་བྲལ་བའི་བསམ་གཏན་པ། །བྱེ་བ་ཕྲག་ནི་བཅུ་གཅིག་བཅུ་གཅིག་ཡོད། །
en: “There will be sixty consecutive congregations, Each of them gathering one hundred ten million Meditators free from grasping at entities.

source: སྟོན་པ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་དགུ་ཁྲི་ཉིས་སྟོང་བར་དུ་གནས། །
en: “And when this teacher has attained nirvāṇa His sacred Dharma will remain for ninety-two thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་རྒྱས་འགྱུར་མཆོད་རྟེན་གྲངས། །བྱེ་བ་ཕྲག་ནི་སྟོང་ཕྲག་བརྒྱད་ཅུ་འབྱུང་། །
en: The relics of this victor will be abundant, And the stūpas will number eight hundred billion.

source: དེ་བཞིན་གཤེགས་པ་གཙོ་བོས་བྱིན་སྐྱེ་བའི། །ཡུལ་ནི་སྐྱེ་བོའི་མཆོད་རྟེན་ཞེས་ཀྱང་བྱ། །
en: “The thus-gone Jyeṣṭhadatta Will be born in a place called Stūpa for Humanity.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གཉིས་ཡབ་ནི་གཙོ་བཟངས་ཡིན། །གཙོ་མཆོག་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend twenty-two leagues. “Excellent Leader will be his father, and Supreme Leader will be this victor’s mother.

source: སྲས་པོ་གཙོ་སྲེད་གཙོ་བོ་རིམ་གྲོ་པ། །
en: Leadership Lover will be his son and Leader his attendant.

source: གཙོས་བྱིན་ཞེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: Leader Gift will be the scholar

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་དྲུག་ཀུན་ལའང་། །རྒྱགས་དང་ང་རྒྱལ་བྲལ་བའི་བསམ་གཏན་པ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་གཉིས་གཉིས་ཡོད། །
en: “There will be thirty-six consecutive congregations, Each of them gathering nine hundred twenty million Meditators free from conceit and pride.

source: སྟོན་པ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་བདུན་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And after this teacher has attained nirvāṇa His sacred Dharma will remain for seventy thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བདུན་པ་གསེར་གྱིས་རྣམ་པར་སྤྲས། །
en: The relics of this victor will reside in a stūpa Seven leagues large and decorated with gold.

source: དེ་བཞིན་གཤེགས་པ་གཙོ་བོ་སྐྱེ་བ་ཡི། །ཡུལ་ནི་མཆོད་པ་མཆོག་དང་ལྡན་ཞེས་བྱ། །
en: “The thus-gone Śreṣṭha Will be born in a place called Endowed with Supreme Offerings.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་གཉིས་ཡོད་ཡབ་ནི་མཆོག་ལེགས་ཡིན། །བསོད་ནམས་རིན་ཆེན་མ་ནི་རྒྱལ་བའི་ཡུམ། །
en: His family will be kṣatriya, And his light will extend twenty-two leagues. “Supreme Excellence will be his father, and Jewel Merit will be this victor’s mother.

source: སྲས་པོ་སྐར་ལྡན་སྐར་བཟངས་རིམ་གྲོ་པ། །
en: Star Possessor will be his son and Auspicious Star his attendant.

source: བསོད་ནམས་འདོད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Merit Wish will be the scholar

source: བདེན་པ་རྣམ་པར་ལྟ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Beholding the Truth the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་དྲུག་ཀུན་ལའང་། །བདུད་དང་ཉོན་མོངས་ལྟ་བ་རབ་འཇོམས་པ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གསུམ་གསུམ་ཡོད། །
en: “There will be sixty-six consecutive congregations, Each of them gathering two hundred thirty million Destroyers of the māras, defilements, and views.

source: ཞི་བར་བྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་དགུ་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And the sacred Dharma of the one gone to peace Will remain for ninety thousand years.

source: འཇིག་རྟེན་མཁྱེན་པ་མྱ་ངན་འདས་པ་ཡི། །སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་ལྔ་པ་གཅིག །
en: When this knower of the world has attained nirvāṇa, His relics will reside in a stūpa five leagues large.

source: དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་མཐུ་རྩལ་གྱི། །སྐྱེ་བའི་ཡུལ་ནི་ཡེ་ཤེས་ལྟ་ཞེས་བྱ། །
en: “The thus-gone Jñānavikrama Will be born in a place called Wisdom View.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །དགུ་བཅུ་རྩ་གཅིག་ཤེས་ལྡན་བཟང་པོ་ཡབ། །ཤེས་མཆོག་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend ninety-one leagues. “Knowledgeable will be his father, and Supreme Knowledge will be this victor’s mother.

source: སྲས་པོ་ཤེས་ལྡན་ཤེས་ཆེན་རིམ་གྲོ་པ། །
en: Knowledgeable will be his son and Great Knowledge his attendant.

source: ཤེས་པའི་ཟླ་བ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Moon of Knowledge will be the scholar

source: བློ་ཡི་མར་མེ་མཁན་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Wise Lamp of the Mind the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཅུ་སྟེ་ཀུན་ལ་ཡང་། །གསེར་དང་བོང་བར་མཚུངས་པར་མཐོང་བ་པོ། །བྱེ་བ་ཕྲག་ནི་ཁྲི་ཕྲག་གསུམ་གསུམ་ཡོད། །
en: “There will be ten consecutive congregations, Each of them gathering three hundred billion Who regard gold and rock in the same way.

source: མི་ཚེ་ལོ་གྲངས་བདུན་ཁྲི་བརྒྱད་སྟོང་ཡིན། །
en: The lifespan of humans will be seventy-eight thousand years,

source: ཞི་བར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་བདུན་ཁྲི་བཞི་སྟོང་བར་དུ་གནས། །
en: “And the sacred Dharma of the one gone to peace Will remain for seventy-four thousand years.

source: ཞི་བར་ཕྱིན་པའི་མཆོད་རྟེན་གྲངས་དག་ནི། །བྱེ་བ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་བརྒྱད་འབྱུང་། །
en: The stūpas of the one gone to peace Will number nine hundred eighty billion.

source: འཇིག་རྟེན་མགོན་པོ་འོད་འཕྲོ་ཅན་སྐྱེ་བའི། །ཡུལ་ནི་གཟི་ལྡན་ལེགས་པར་མཆོད་ཅེས་བྱ། །
en: “The protector of the world, Arciṣmat, Will be born in a place called Splendid Offerings.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གཉིས་ཡབ་ནི་གསལ་བ་ཡིན། །རྡོ་རྗེའི་འོད་ནི་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །འོད་འཕྲོ་འོད་འཕྲོ་བཟང་པོ་རིམ་གྲོ་པ། །
en: His family will be kṣatriya, And his light will extend twenty-two leagues. “Luminous will be his father, and Vajra Light will be this victor’s mother. Radiance will be his son and Excellent Radiance his attendant.

source: ཡོན་ཏན་འོད་འཕྲོ་ཅན་ནི་མཁས་པ་སྟེ། །
en: Radiance of Qualities will be the scholar

source: རྣམ་པར་གྲོལ་བའི་སྒྲོན་མ་རྫུ་འཕྲུལ་ཅན། །
en: And Lamp of Liberation the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །དགྲ་བཅོམ་མི་སློབ་ཉོན་མོངས་བསྲེགས་པ་པོ། །ཐེར་འབུམ་ཐེར་འབུམ་དག་ནི་འདུས་པར་འགྱུར། །
en: “There will be eighty consecutive congregations, Each of them gathering one billion Worthy ones who have gone beyond training and burned defilement away.

source: མྱ་ངན་འདས་ནས་དེ་ཡི་དམ་ཆོས་དག །ལོ་གྲངས་བདུན་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And upon attaining nirvāṇa The sacred Dharma will remain for seventy thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །ཡིད་དུ་འོང་བའི་གདུགས་སྟོང་སྙེད་ཀྱིས་བརྒྱན། །
en: The relics of this victor will be abundant And adorned with thousands of beautiful parasols.

source: སེམས་ཅན་སྙིང་པོ་དབང་པོ་སྐྱེ་བ་ཡི། །ཡུལ་ནི་དབང་པོའི་ཏོག་དང་ལྡན་ཞེས་བྱ། །
en: “The heart of sentient beings, Indra, Will be born in a place called Endowed with the Crest of Indra.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་རྒྱལ་མཚན་དབང་པོ་ཡབ། །རིན་ཆེན་མཆོག་མ་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend one hundred leagues. “Ruling Banner will be his father, and Supreme Jewel will be this victor’s mother.

source: དབང་པོ་སྲས་ཡིན་བཟང་དབང་རིམ་གྲོ་པ། །
en: Ruler will be his son and Excellent Ruler his attendant.

source: དབང་ཆེན་ཏོག་ནི་བློ་གྲོས་ཅན་ཡིན་ཏེ། །
en: Crest of Great Rule will be the scholar

source: མཚོན་ཆའི་དབང་པོ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Weapon Ruler the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་དྲུག་ཀུན་ལའང་། །མི་སློབ་དགྲ་བཅོམ་པ་ཡི་ཚོགས་ཀུན་དག །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་གཉིས་གཉིས་ཡོད། །
en: “There will be sixty-six consecutive congregations, Each of them gathering nine hundred twenty million Worthy ones who have gone beyond training.

source: དམ་ཆོས་ལོ་གྲངས་ཆིག་ཁྲི་ཆིག་སྟོང་གནས། །
en: “And the sacred Dharma will remain for eleven thousand years.

source: སྐུ་གདུང་མཆོད་རྟེན་ཡིད་འོང་གཅིག་ཡིན་ལ། །འཕང་དུ་དཔག་ཚད་བཅུ་གཉིས་པ་ཡིན་ཏེ། །གསེར་གྱི་རྒྱལ་མཚན་ཏོག་བཅས་དག་གིས་སྤྲས། །
en: The relics will reside in a single, beautiful stūpa That will be twelve leagues tall And adorned with golden crested banners.

source: དེ་བཞིན་གཤེགས་པ་ཤུགས་འཆང་སྐྱེ་བ་ཡི། །ཡུལ་ནི་ཆོས་ཀྱི་རྒྱལ་མཚན་ཞེས་ཀྱང་བྱ། །
en: “The thus-gone Vegadhārin Will be born in a place called Dharma Banner.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །བདུན་ཅུ་རྩ་གཉིས་ཡབ་ནི་བློ་བཟངས་ཡིན། །ཡོན་ཏན་རྒྱ་མཚོ་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend seventy-two leagues. “Excellent Mind will be his father, and Ocean of Qualities will be this victor’s mother.

source: སྲས་པོ་བདེན་སྨྲ་སྟོབས་ལྡན་རིམ་གྲོ་པ། །
en: Truth Speaker will be his son and Powerful his attendant.

source: མཐུ་རྩལ་སྟོབས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Powerful Strength will be the scholar

source: གོམས་པར་མཆོད་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Worship of Meditative Accomplishment the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །ཕྱིར་མི་ལྡོག་པ་བྱང་ཆུབ་གནས་པ་ཀུན། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་བཞི་བཞི་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering seven hundred forty million Bodhisattvas who are all irreversible.

source: རྒྱལ་བ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །
en: “And after this victor has attained nirvāṇa

source: ལོ་གྲངས་ཐེར་འབུམ་ཕྲག་ནི་གསུམ་དུ་གནས། །
en: His sacred Dharma will remain for three billion years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །ཞིང་རྣམས་ཀུན་དུ་མཛེས་པ་དག་ཏུ་འགྱུར། །
en: The relics of this victor will be abundant, Filling all the lands with beauty.

source: སེམས་ཅན་སྙིང་པོ་སྐར་རྒྱལ་སྐྱེ་བ་ཡི། །ཡུལ་ནི་འོད་འཕྲོའི་འོད་དང་ལྡན་ཞེས་བྱ། །
en: “The heart of sentient beings, Tiṣya, Will be born in a place called Endowed with Radiant Light.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་སྦྱིན་སྲེག་འོད་འཕྲོ་ཡབ། །འོད་འཕྲོ་ཆེན་མོ་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend one hundred leagues. “Radiant Sacrifice will be his father, and Great Radiance will be this victor’s mother.

source: སྲས་པོ་སྐར་མཁན་སྣང་དབང་རིམ་གྲོ་པ། །
en: Astrologer will be his son and Lord of Light his attendant.

source: རབ་ཏུ་བརྒྱན་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Thoroughly Adorned will be the scholar

source: འོད་དབང་མཐའ་ཡས་པ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Infinite Lord of Light the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་དྲུག་ཀུན་ལའང་། །དགྲ་བཅོམ་རྣམ་པར་ཐར་པ་བརྒྱད་ཐོབ་པ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་གསུམ་གསུམ་ཡོད། །
en: “There will be thirty-six consecutive congregations, Each of them gathering seven hundred thirty million Worthy ones who have attained the eight liberations.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བཅུ་པ་རིན་པོ་ཆེ་ཡིས་སྤྲས། །
en: The relics of this victor will reside in a single stūpa Measuring ten leagues and studded with jewels.

source: འཇིག་རྟེན་མགོན་པོ་འོད་ནི་བཟང་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ནོར་འབྱོར་པ་ཞེས་བྱ། །
en: “The protector of the world, Suprabha, Will be born in a place called Riches.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གཉིས་ཡབ་ནི་བློ་བཟངས་ཡིན། །བློ་འོད་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend twenty-two leagues. “Excellent Mind will be his father, and Radiant Mind will be this victor’s mother.

source: སྲས་པོ་བློ་ལེགས་བློ་ཆེན་རིམ་གྲོ་པ། །
en: Excellent Mind will be his son and Great Mind his attendant.

source: བློ་ཡི་འབྱུང་གནས་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Source of Mind will be the scholar

source: བློ་ལ་གནས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Remaining in Mind the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །སྲིད་པ་ཀུན་ལ་ཆགས་པ་མེད་གྱུར་པ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་གཉིས་གཉིས་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering nine hundred twenty million Who are free from attachment to all of existence.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་གསེར་གྱི་རྒྱལ་མཚན་དག་གིས་བསྐོར། །
en: The relics of this victor will be abundant, Residing in stūpas surrounded by banners.

source: འཇིག་རྟེན་མགོན་པོ་གྲགས་པ་བྱིན་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་མཆོད་ཅིང་བཀུར་ཞེས་བྱ། །
en: “The protector of the world, Yaśodatta, Will be born in a place called Worship and Veneration.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །སུམ་ཅུ་རྩ་གཉིས་ཡབ་ནི་བློ་བཟངས་ཡིན། །བྱང་ཆུབ་འདོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend thirty-two leagues. “Excellent Mind will be his father, and Wish for Awakening will be this victor’s mother.

source: སྲས་པོ་ཟམ་པ་དུལ་བ་རིམ་གྲོ་པ། །
en: Bridge will be his son and Training his attendant.

source: ཕྱོགས་ཀྱི་མཆོད་རྟེན་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Stūpa of the Directions will be the scholar

source: འཇིག་རྟེན་མངོན་བསྟོད་པ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Praise of the World the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་རྩ་བཞི་སྟེ། །ཀུན་ལའང་ཐ་བ་མེད་པར་བསྒོམས་པ་པོ། །བྱེ་བ་ཕྲག་ནི་སྟོང་སྟོང་འབྱུང་བར་འགྱུར། །
en: “There will be eighty-four consecutive congregations, Each of them gathering ten billion Contemplatives who are entirely free of the defilements.

source: འགོག་པར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་བརྒྱད་ཁྲི་སུམ་སྟོང་བར་དུ་གནས། །
en: “And after this teacher has gone to cessation His sacred Dharma will remain for eighty-three thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བརྒྱད་པ་གསེར་གྱིས་རྣམ་པར་སྤྲས། །
en: The relics of this victor will reside in a single stūpa Eight leagues large and decorated with gold.

source: སེམས་ཅན་སྙིང་པོ་གཟུགས་ནི་བཟང་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ཐར་པ་དགའ་ཞེས་བྱ། །
en: “The heart of sentient beings, Surūpa, Will be born in a place called Liberation Joy.

source: དེའི་རིགས་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །དྲུག་ཅུ་རྩ་གཉིས་ཡབ་ནི་དོན་ཆེན་ཡིན། །ཡོན་ཏན་ཚོགས་ནི་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །ཡོན་ཏན་བདག་ཉིད་དོན་ལྡན་རིམ་གྲོ་པ། །
en: His family will be kṣatriya, And his light will extend sixty-two leagues. “Great Objective will be his father, and Gathering of Qualities will be this victor’s mother. Being of Qualities will be his son and Meaningful his attendant.

source: ཡོན་ཏན་མེ་ཏོག་རྒྱས་པ་མཁས་པ་སྟེ། །
en: Blooming Flower of Qualities will be the scholar

source: མཐའ་ཡས་ཡོན་ཏན་དོན་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Pursuit of Infinite Qualities the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །དགྲ་བཅོམ་རིམས་ནད་མེད་པ་དགེ་བ་ཅན། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་གསུམ་གསུམ་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering seven hundred thirty million Worthy ones who are free from the plagues and endowed with virtue.

source: ལྷག་མ་མེད་པར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་བདུན་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And after this teacher has gone without remainder His sacred Dharma will remain for seventy thousand years.

source: མཚུངས་པ་མེད་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །ཞིང་རྣམས་ཀུན་དུ་སྐུ་གདུང་རྒྱས་པར་འགྱུར། །
en: When this incomparable one has attained nirvāṇa His relics will fill all realms.

source: མཚུངས་པ་མེད་པ་རྒྱལ་པོ་སྐྱེ་བ་ཡི། །ཡུལ་ནི་དད་པའི་རྒྱལ་པོ་ཞེས་ཀྱང་བྱ། །
en: “The incomparable Rājan Will be born in a place called King of Faith.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །བདུན་ཅུ་རྩ་གཉིས་གཟི་བརྗིད་བཟང་པོ་ཡབ། །རྒྱལ་པོའི་འོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend seventy-two leagues. “Excellent Splendor will be his father, and Royal Radiance will be this victor’s mother.

source: སྲས་པོ་རྒྱལ་བྱིན་རྒྱལ་ཆེན་རིམ་གྲོ་པ། །
en: Royal Gift will be his son and Great King his attendant.

source: མི་ཡི་རྒྱལ་པོ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: King of Humans will be the scholar

source: རྒྱལ་པོ་དད་པར་བྱེད་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Faith-Instilling King the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་བརྒྱད་ཀུན་ལའང་། །དགྲ་བཅོམ་གྲགས་པ་བསྒྲུབས་པ་དེ་དག་གྲངས། །ཐེར་འབུམ་ཐེར་འབུམ་དག་ནི་འདུས་པར་འགྱུར། །
en: “There will be eighty-eight consecutive congregations, Each of them gathering one billion Worthy ones who joyfully accomplish fame.

source: མི་ཚེ་ལོ་གྲངས་འབུམ་ཕྲག་ཉི་ཁྲི་ཡིན། །
en: The lifespan of humans will be one hundred twenty thousand years,

source: རྣམ་པར་གྲོལ་བར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་དགུ་ཁྲི་ཉིས་སྟོང་བར་དུ་གནས། །
en: “And the sacred Dharma of the one gone to peace Will remain for ninety-two thousand years.

source: རྒྱལ་བ་མྱ་ངན་འདས་པའི་སྐུ་གདུང་དག །ཞིང་རྣམས་ཀུན་དུ་ཁྱབ་པར་འབྱུང་བར་འགྱུར། །
en: When this victor has attained nirvāṇa His relics will fill all of the realms.

source: དེ་བཞིན་གཤེགས་པ་དོན་ནི་གྲུབ་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ཐར་པ་འབྱོར་ཞེས་བྱ། །
en: “The thus-gone Arthasiddhi Will be born in a place called Reaching Liberation.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་བཅུ་ཡབ་ནི་བདེ་དོན་ཡིན། །དོན་ལ་དགའ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend ninety leagues. “Happiness Accomplished will be his father, and Meaningful Joy will be this victor’s mother.

source: སྲས་པོ་དོན་སྦྱིན་དོན་ཆེན་རིམ་གྲོ་པ། །
en: Meaningful Gift will be his son and Great Meaning his attendant.

source: སྤོབས་པ་བརྩེགས་པ་བློ་གྲོས་ཅན་ཡིན་ཏེ། །
en: Compiled Acumen will be the one of intelligence

source: བསོད་ནམས་འོད་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Light of Merit the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །རྒྱགས་དང་ང་རྒྱལ་བྲལ་བ་འཁྲུལ་མེད་པ། །བྱེ་བ་ཕྲག་ནི་བརྒྱད་ཅུ་གཉིས་གཉིས་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering eight hundred twenty million Who are free from conceit, pride, and delusion.

source: ཐ་བ་སྤངས་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་བརྒྱད་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And the sacred Dharma of the one who has relinquished the defilements Will also remain for eighty thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་གི་མཆོད་རྟེན་ནི། །དཔག་ཚད་དགུ་པ་གཅིག་ཅིག་འབྱུང་བར་འགྱུར། །
en: The relics of this victor will reside In a single stūpa measuring nine leagues.

source: དེ་བཞིན་གཤེགས་པ་སེང་གེའི་སྡེ་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་བཟོད་པར་དཀའ་ཞེས་བྱ། །
en: “The thus-gone Siṃhasena Will be born in a place called Hard to Bear.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱད་ཡོད་མཆོད་སྦྱིན་བཟང་པོ་ཡབ། །འཕགས་པའི་འོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend eight leagues. “Excellent Sacrifice will be his father, and Light of the Noble will be this victor’s mother.

source: སྲས་པོ་འབྲུག་སྒྲ་ཏོག་ནི་རིམ་གྲོ་པ། །
en: Sound of Thunder will be his son and Crest his attendant.

source: དཔའ་སྟོབས་ཅན་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Courageous Strength will be the scholar

source: སེང་གེའི་སྟབས་ཀྱིས་འགྲོ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Lion Gait the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་དྲུག་ཀུན་ལའང་། །མཆོད་པ་མཆོག་གིས་མཆོད་པར་འོས་པ་པོ། །དགྲ་བཅོམ་ཐ་སྤངས་ཐེར་འབུམ་ཐེར་འབུམ་ཡོད། །
en: “There will be sixty-six consecutive congregations, Each of them gathering one billion Worthy ones who merit supreme worship.

source: གཟུང་བ་མེད་པར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་ཉི་ཁྲི་བཞི་སྟོང་བར་དུ་གནས། །
en: “And the sacred Dharma of the one gone beyond grasping Will remain for twenty-four thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བྱེ་བ་འབུམ་ཕྲག་དགུ་བཅུ་དགུ། །
en: The relics of this victor will be abundant, Residing in ninety-nine trillion stūpas.

source: སེམས་ཅན་སྙིང་པོ་ནོར་ལྷའི་བུ་སྐྱེ་བའི། །ཡུལ་ནི་གཟི་བརྗིད་འབྱུང་བ་ཞེས་ཀྱང་བྱ། །
en: “The heart of sentient beings, Vāsava, Will be born in a place called Source of Splendor.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །སུམ་ཅུ་རྩ་གཉིས་ཟླ་བའི་དབང་པོ་ཡབ། །རྒྱུ་སྐར་རྒྱལ་པོ་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །ལེགས་འོངས་པང་ནས་སྐྱེས་པ་རིམ་གྲོ་པ། །
en: His family will be brahmin, And his light will extend thirty-two leagues. “Moon Ruler will be his father, and Star King will be this victor’s mother. Excellent Arrival will be his son and Lap Born his attendant.

source: ལྷ་ཡི་འོད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Divine Light will be the scholar

source: ལྷ་ཡི་མིག་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Divine Eye the one of miracles.

source: འདུས་པ་ལན་གྲངས་དགུ་བཅུ་ཀུན་ལ་ཡང་། །དགྲ་བཅོམ་བསོད་ནམས་འབྲས་བུ་མཆོག་ཐོབ་པ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་གཉིས་གཉིས་ཡོད། །
en: “There will be ninety consecutive congregations, Each of them gathering seven hundred twenty million Worthy ones who have attained the supreme fruition of merit.

source: མི་ཚེ་ལོ་གྲངས་དགུ་ཁྲི་བཞི་སྟོང་ཡིན། །
en: The lifespan of humans will be ninety-four thousand years,

source: སྲིད་པ་ཞི་བར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་དགུ་ཁྲི་ཉིས་སྟོང་བར་དུ་གནས། །
en: “And the sacred Dharma of the one who has reached the pacification of existence Will remain for ninety-two thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་ལྔ་པ་རིན་པོ་ཆེ་ཡིས་སྤྲས། །
en: The relics of this victor will reside in a single stūpa Five leagues large and studded with jewels.

source: མཚུངས་པ་མེད་པ་གྲགས་པ་སྐྱེ་བ་ཡི། །ཡུལ་ནི་མཆོད་པ་དག་གིས་བརྒྱན་ཞེས་བྱ། །
en: “The incomparable Yaśas Will be born in a place called Adorned with Offerings.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་ཡོད་ཡབ་ནི་འབྱོར་ལྡན་ཡིན། །གྲགས་མཆོག་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend nine leagues. “Endowed with Wealth will be his father, and Supreme Fame will be this victor’s mother.

source: སྲས་པོ་སྐར་ལྡན་ལེགས་བྱིན་རིམ་གྲོ་པ། །
en: Star Possessor will be his son and Excellent Gift his attendant.

source: མཐུ་རྩལ་ཟླ་བ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Moon of Power will be the scholar
